package com.example.gbnm.data

object NoGodNo {
    val MARKDOWN = "## Как же стать *web* разработчиком?\n" +
            "\n" +
            "#### Многие программисты в начале своего пути не могут определиться с последовательностью того, что и как им изучать.\n" +
            "\n" +
            "Сейчас я работаю в *google*, но когда я начинал, то тоже не знал с чего начать.\n" +
            "\n" +
            "> \"Есть люди, которые никогда не ошибаются, потому что не хотят делать\" - *Иоганн Вольфганг Гёте (немецкий поэт 1749 - 1832)*\n" +
            "\n" +
            "Итак, я решил начать свой путь в *web* разработке с **HTML**. Начав с синтаксиса языка разметки, я постепенно заметил, что есть некоторые формы, которые я могу использовать, чтобы упростить себе жизнь.Примерно такие вещи я начал замечать и составлять примерно такие шаблоны: \n" +
            "\n" +
            "```html\n" +
            "<!DOCTYPE html>\n" +
            "<html>\n" +
            "  <head>\n" +
            "    <meta charset=\"utf-8\">\n" +
            "    <title>sample</title>\n" +
            "  </head>\n" +
            "  <body>\n" +
            "    <img src=\"images/image.png\" alt=\"My alt\">\n" +
            "  </body>\t\n" +
            "</html>\n" +
            "```\n" +
            "\n" +
            " Когда я понял, что продукт, получившийся в процессе моей разработки выглядит некрасиво, я начала искать способ сделать сайт красивее.В тот момент я и познакомился с **CSS**.Также начинал с синтаксиса, потом приступил к практике.Начало получаться что-то примерно такое.\n" +
            "\n" +
            "```html\n" +
            "<!DOCTYPE html>\n" +
            "<html>\n" +
            "<head>\n" +
            "<style>\n" +
            "p {\n" +
            "  color: green;\n" +
            "  text-align: center;\n" +
            "} \n" +
            "</style>\n" +
            "</head>\n" +
            "<body>\n" +
            "\n" +
            "<p>Hello World!</p>\n" +
            "<p>These paragraphs are styled with CSS.</p>\n" +
            "\n" +
            "</body>\n" +
            "</html>\n" +
            "```\n" +
            "\n" +
            "Выдавала эта вещь вот это: \n" +
            "\n" +
            "```\n" +
            "Hello World!\n" +
            "\n" +
            "These paragraphs are styled with CSS.\n" +
            "```\n" +
            "\n" +
            "(покрасить в зелёныйъуъ)\n" +
            "\n" +
            "Стало лучше, но ещё не достаточно хорошо,поэтому я приступил к изучению общих правил дизайна ( Material, Flat), старался делать дизайн адаптивным для каждого устройства.\n" +
            "\n" +
            "---\n" +
            "\n" +
            "Когда я уже смог попасть на первую работу (второй уже была **Google**), мне показали JavaScript, который буквально является сердцем *web* разработки. Тут сразу и не скажешь с чего начать, так как каждый *framework* буквально меняет весь язык. По-моему мнению начинать стоит всё-таки с чистого JavaScript, чтобы лучше разобраться как происходит *web* разработка.\n" +
            "\n" +
            "После **JS** мой путь свернул в сторону серверной части и я заинтересовался, как же я могу написать сервер с помощью языка, который уже знаю, так я и перешёл на *Node.js* . В тот момент я уже работал в общей сложности около 4 лет и начал пытаться попасть в *Google* отправляя им свои мотивационные письма. Так как *Node.js* является фреймворком для написания серверов, то мне пришлось изучать *sql* и структуры данных. Тут было уже никак не обойтисчь без инструмента, которым пользуется каждый программист в современном мире. Этим интсрументом является **GIT**.\n" +
            "\n" +
            "-----\n" +
            "\n" +
            "В какой-то момент, я уволился с работы и решил создать свою собсвтенную *web*- студию, но идею попасть в *google* на работу я не забрасывал и уже второй год писал им. В один момент, когда у меня появился знакомый , который до этого обратился  к нам в с тудию с обычнм заказом, и с его помощь я всё-таки смог доставить письмо в *google* и попасть на собеседование. Вот таким путём в 7 лет, я добрался от нуля до разработчика *google*.\n" +
            "\n" +
            ">\"Нет ничего невозможного. Само слово говорит:Я возможно!\" - Одри Хепбёрн \n"
}
